/* Details of the book */
"About this book" = "Zvizere zvepaBhuku";

/* Writer of the book */
"Author" = "Munyori";

/* Header Name */
"Books" = "Mabhuku";

/* Book title */
"Title" = "Musoro weBhuku";

